[
    {
        "id": 7,
        "name": "EvntManager",
        "desc": "An event management web app designed for photographer and videographers to manage their events and clients. Being a wedding filmmaker myself, I know how important it is to have a way to manage events, deadlines, and client expectations.\n\nThis app allows creative professionals to manage all aspects of a shoot in a single place.",
        "summary": "A web app to manage events and clients for photographer and videographers.",
        "notableFeatures": [
            "NextJS with Supabase for the backend.",
            "AI inspired UI/UX design.",
            "Future proof system design for scalability.",
            "Full CI/CD pipeline with Github Actions.",
            "Dockerized for easy deployment."
        ],
        "tech": [
            "nextjs",
            "supabase",
            "docker",
            "github-actions",
            "cursor/ai"
        ],
        "img": "images/evntmanager.png",
        "github": "",
        "demo": "https://evntmanager.io",
        "viewType": "Website",
        "link": "https://evntmanager.io",
        "gallery": [
            "images/evntmanager.png",
            "images/evntmanager-1.png",
            "images/evntmanager-2.png",
            "images/evntmanager-3.png"
        ]
    },
    {
        "id": 3,
        "name": "Films By Zakir",
        "desc": "Needed to create a website for my side hustle as a wedding filmmaker based out of New York City. The website serves as a portfolio for my work and also a way to showcase my work to potential clients. Additionally, users can contact me through the website to get in touch with me.",
        "summary": "Portfolio website for a wedding filmmaker based out of New York City",
        "notableFeatures": [
            "Lightweight and fast website that is hosted on a self-managed Raspberry Pi server",
            "Video gallery that is hosted on Youtube and embedded into the website"
        ],
        "tech": [
            "react",
            "emailjs",
            "nginx",
            "docker",
            "github-actions"
        ],
        "img": "images/filmsbyz.png",
        "demo": "https://filmsbyzakir.com",
        "viewType": "Website",
        "github": "",
        "link": "",
        "gallery": [
            "images/filmsbyz.png",
            "images/filmsbyz-1.png"
        ]
    },
    { 
    "id": 6,
        "name": "Cat Food Tracker",
        "desc": "I have 2 cats in my house and I wanted to track what type of food and when we or my wife give it to the cats. As we both work full time sometimes we end up overfeeding or even giving the same food to the cats. This is a simple app that allows us to track the food and the amount of food given to the cats.",
        "summary": "A simple app to track the food and the amount of food given to the cats.",
        "notableFeatures": [
            "Used React to create a simple and easy to use interface.",
            "Used Supabase to store the data.",
            "Used Tailwind CSS to style the app.",
            "Used Docker to containerize the app."
        ],
        "tech": [
            "react",
            "supabase",
            "tailwind",
            "docker"
        ],
        "img": "images/catfood.png",
        "github": "https://github.com/mjhossain/catfoodtracker.git",
        "demo": "",
        "viewType": "Presented on Request",
        "link": "",
        "gallery": [
            "images/catfood.png"
        ]
    },

    {
        "id": 2,
        "name": "BudgetBuddy",
        "desc": "BudgetBuddy is a very simple budget tracking application that allows users to track their income and expenses. It is built using React and the backend is a simple google sheet that is updated using google apps-script. The idea was to create a simple and easy to use budget tracking application that is free and user's data is stored in their own google sheet.",
        "summary": "budget tracking application built using React and a google sheet",
        "notableFeatures": [
            "Free and user's data is stored in their own google sheet",
            "Simple and easy to use interface",
            "Open source and user can host their own instance of the application",
            "No need to sign up or login to use the application"
        ],
        "tech": [
            "react",
            "google apps-script",
            "tailwind",
            "nginx",
            "docker",
            "github-actions",
            "google-apps-script"
        ],
        "img": "images/budgetbuddy.png",
        "github": "https://github.com/mjhossain/budget-app",
        "demo": "https://budget.mointech.dev",
        "viewType": "Github Repo",
        "link": "https://github.com/mjhossain/budget-app",
        "gallery": [
            "images/budgetbuddy.png"
        ]
    },

    {
        "id": 5,
        "name": "NYC Crime Visualizer",
        "desc": "This project is a comprehensive data analysis and visualization initiative developed as part of a school assignment. The primary objective was to explore and understand crime trends in New York City using publicly available data from the NYC Open Data portal and find safe Airbnb locations in New York City.",
        "summary": "data analysis and visualization initiative developed as part of a school assignment",
        "notableFeatures": [
            "Used publicly available data from the NYC Open Data portal",
            "Used pandas to analyze the data",
            "Used Folium to create the visualization"
        ],
        "img": "images/crime-visual.png",
        "tech": [
            "python",
            "open-data",
            "api"
        ],
        "demo": "",
        "github": "https://github.com/mjhossain/crime-visualization",
        "viewType": "Github Repo",
        "link": "https://github.com/mjhossain/crime-visualization",
        "gallery": [
            "images/crime-visual.png"
        ]
    },
    {
        "id": 4,
        "name": "Homelab",
        "desc": "I have a hybrid homelab environment composed of a cluster of Raspberry Pi servers alongside a centralized Proxmox hypervisor running on a mini PC. The Raspberry Pi cluster serves as a distributed system, handling lightweight workloads, microservices, and some specific edge computing tasks. These Pis are networked together and often used for experimentation, Kubernetes deployments, and running containerized applications that don't require significant compute power.\n\nThe main backbone of the setup is the Proxmox hypervisor hosted on a mini PC, which acts as the central virtualization hub. This hypervisor is responsible for running the majority of my virtual machines (VMs), and Docker containers, which include critical services such as web servers, internal tools, monitoring solutions (UpTime Kuma), NAS servers, and various automation services. Some of the services hosted include my personal websites, reverse proxy setups (NGINX), CI/CD pipelines, and automation frameworks like Ansible and Home Assistant for IoT integrations.\n\nThe combination of the Proxmox hypervisor and Raspberry Pi cluster allows me to experiment with both centralized and distributed computing models while maintaining flexibility and scalability within my homelab.",
        "summary": "A cluster of Raspberry Pi servers and a main Proxmox hypervisor running on a mini PC hosting all my containers, websites and automation services.",
        "notableFeatures": [
            "Used Proxmox to create a hypervisor and host all my containers, websites and automation services.",
            "Used Raspberry Pi servers as the nodes for my cluster.",
            "Used WireGuard to create a secure and private network between the Raspberry Pi cluster and the Proxmox hypervisor."        
        ],
        "tech": [
            "proxmox",
            "raspberry-pi",
            "docker",
            "nginx",
            "uptime-kuma",
            "home-assistant",
            "wireguard"
        ],
        "img": "images/homelab.png",
        "github": "",
        "demo": "",
        "viewType": "Presented on Request",
        "link": "",
        "gallery": [
            "images/homelab.png",
            "images/homelab-1.png",
            "images/homelab-2.png",
            "images/homelab-3.png"
        ]
    }
]