[
    {
        "id": 1,
        "name": "portfolio1.0",
        "desc": "This website was created to showcase my skills and projects. It was created with an intention to teach myself React and also creating CI/CD piplines using Github Actions.",
        "summary": "portfolio website hosted on a self-managed Raspberry Pi server",
        "deployment": "The project's versioning is controlled through Github and the site is deployed using Docker and Github Actions. The site is hosted on a self-managed Raspberry Pi server. The intention behind such a setup is to learn  DevOps practices and also to have a quick and easy way to migrate to a new server.",
        "notableFeatures": [
            "Shell inspired design that gives users a unique and engaging experience to explore the website.",
            "The project is hosted on a self-managed Raspberry Pi server.",
            "Deployed as a Docker container on the server."
        ],
        "tech": [
            "react",
            "ci/cd",
            "docker",
            "nginx",
            "github-actions"
        ],
        "img": "images/portfolio.png",
        "github": "https://github.com/mjhossain/portfolio1.0",
        "demo": "",
        "viewType": "none",
        "gallery": [
            "images/portfolio.png",
            "images/xtrack.png",
            "images/filmsbyz.png"
        ]
    },
    {
        "id": 2,
        "name": "BudgetBuddy",
        "desc": "BudgetBuddy is a very simple budget tracking application that allows users to track their income and expenses. It is built using React and the backend is a simple google sheet that is updated using google apps-script. The idea was to create a simple and easy to use budget tracking application that is free and user's data is stored in their own google sheet.",
        "summary": "budget tracking application built using React and a google sheet",
        "notableFeatures": [
            "Free and user's data is stored in their own google sheet",
            "Simple and easy to use interface",
            "Open source and user can host their own instance of the application",
            "No need to sign up or login to use the application"
        ],
        "tech": [
            "react",
            "google apps-script",
            "tailwind",
            "nginx",
            "docker",
            "github-actions",
            "google-apps-script"
        ],
        "img": "images/budgetbuddy.png",
        "github": "https://github.com/mjhossain/budget-app",
        "demo": "https://budget.mointech.dev",
        "viewType": "Github Repo",
        "link": "https://github.com/mjhossain/budget-app"
    },
    {
        "id": 3,
        "name": "Films By Zakir",
        "desc": "Needed to create a website for my side hustle as a wedding filmmaker based out of New York City. The website serves as a portfolio for my work and also a way to showcase my work to potential clients. Additionally, users can contact me through the website to get in touch with me.",
        "summary": "Portfolio website for a wedding filmmaker based out of New York City",
        "notableFeatures": [
            "Lightweight and fast website that is hosted on a self-managed Raspberry Pi server",
            "Video gallery that is hosted on Youtube and embedded into the website"
        ],
        "tech": [
            "react",
            "emailjs",
            "nginx",
            "docker",
            "github-actions"
        ],
        "img": "images/filmsbyz.png",
        "demo": "https://filmsbyzakir.com",
        "viewType": "Website",
        "github": "",
        "link": "",
        "gallery": [
            "images/filmsbyz.png"
        ]
    },
    {
        "id": 4,
        "name": "NYC Crime Visualizer",
        "desc": "This project is a comprehensive data analysis and visualization initiative developed as part of a school assignment. The primary objective was to explore and understand crime trends in New York City using publicly available data from the NYC Open Data portal.",
        "summary": "data analysis and visualization initiative developed as part of a school assignment",
        "notableFeatures": [
            "Used publicly available data from the NYC Open Data portal",
            "Used pandas to analyze the data",
            "Used Folium to create the visualization"
        ],
        "img": "images/crime-visual.png",
        "tech": [
            "python",
            "open-data",
            "api"
        ],
        "demo": "",
        "github": "https://github.com/mjhossain/crime-visualization",
        "viewType": "Github Repo",
        "link": "https://github.com/mjhossain/crime-visualization"
    },
    {
        "id": 5,
        "name": "File Copier",
        "desc": "A school project created that takes a csv file that consits of list of file names and copies them from selected source to destination",
        "summary": "school project created that copies files from a source to a destination based on a csv file",
        "notableFeatures": [
            "Used java to create the application",
            "Used javax.swing to create the GUI"
        ],
        "tech": [
            "java",
            "javax"
        ],
        "img": "images/copier.png",
        "github": "https://github.com/mjhossain/FileCopier",
        "demo": "",
        "viewType": "Github Repo",
        "link": "https://github.com/mjhossain/FileCopier"
    },
    {
        "id": 6,
        "name": "Powershell Scripts",
        "desc": "This project involves the development and deployment of a series of automation scripts tailored for Managed Service Provider (MSP) clients. These automated processes span both Azure cloud environments and on-premises server infrastructures.",
        "summary": "automation scripts for MSP clients",
        "notableFeatures": [
            "PowerShell scripts to automate tasks in Azure and on-premises servers",
            "Automated business processes to save time and reduce manual errors",
            "Utilized Microsoft Power Automate to create sophisticated automation workflows"
        ],
        "tech": [
            "powershell",
            "microsoft-power-automate",
            "azure",
            "microsoft-server",
            "google-apps-script"
        ],
        "img": "images/powershell.png",
        "github": "",
        "demo": "",
        "viewType": "Presented on Request",
        "link": ""
    }
]